In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
# window에서 한글 출력해주는 코드
from matplotlib import font_manager,rc
font_name = font_manager.FontProperties(fname="c:\Windows\Fonts\malgun.ttf").get_name()
rc('font',family = font_name)
from numpy.random import randn
from pandas import DataFrame

In [6]:
dic = {'city':['서울','부산','대전','대구','광주'],
      'year':[2017,2017,2018,2018,2018],
      'temp':[18,20,19,21,20]}
data = pd.DataFrame(dic)
print(data)

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [8]:
data[['year','city','temp']]

   year city  temp
0  2017   서울    18
1  2017   부산    20
2  2018   대전    19
3  2018   대구    21
4  2018   광주    20

In [10]:
data.index = ['a','b','c','d','e']
data

  city  year  temp
a   서울  2017    18
b   부산  2017    20
c   대전  2018    19
d   대구  2018    21
e   광주  2018    20

In [12]:
data.columns = ['도시','연도','날씨'] ; data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [14]:
data.iloc[1:3]

   도시    연도  날씨
b  부산  2017  20
c  대전  2018  19

In [15]:
print(data.iloc[2,2])

19

In [16]:
data.set_index(['도시'],inplace=True) ; data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [17]:
data.loc['서울']

연도    2017
날씨      18
Name: 서울, dtype: int64

In [18]:
data.iloc[1:2]

      연도  날씨
도시
부산  2017  20

In [19]:
cars = [50,40,20,30,10]
data['car'] = cars; data

      연도  날씨  car
도시
서울  2017  18   50
부산  2017  20   40
대전  2018  19   20
대구  2018  21   30
광주  2018  20   10

In [20]:
data['high'] = data.car >= 30 ; data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10  False

In [32]:
data['c'] = data['car']
data

      연도  날씨  car   high   c
도시
서울  2017  18   50   True  50
부산  2017  20   40   True  40
대전  2018  19   20  False  20
대구  2018  21   30   True  30
광주  2018  20   10  False  10

In [38]:
data.columns = ['year','temp','crime','high','car'] ; data
data['high'] = data.temp >= 20
print(data)

    year  temp  crime   high  car
도시
서울  2017    18     50  False   50
부산  2017    20     40   True   40
대전  2018    19     20  False   20
대구  2018    21     30   True   30
광주  2018    20     10   True   10

In [68]:
data = data.drop(['crime','high','car'],1)

In [71]:
data.columns = ['연도','날씨']
data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [72]:
f = lambda x: x.max() - x.min() # 일시적 함수 생성-lambda
df = pd.DataFrame(np.arange(12).reshape(4,3),columns = ['A','B','C'], index = ['a','b','c','d'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [54]:
df.apply(f) #apply f를 적용시킴 열 기준

A    9
B    9
C    9
dtype: int64

In [55]:
df.apply(f,1) # 행 기준

a    2
b    2
c    2
d    2
dtype: int64

In [73]:
region = pd.Series(['서울','부산','대전','대구','광주'],index=['1','2','3','4','5'])
print(region)

1    서울
2    부산
3    대전
4    대구
5    광주
dtype: object

1    서울
2    부산
3    대전
4    대구
5    광주
dtype: object

In [75]:
dic = {'서울':800,'대구':150,'부산':100}
s = pd.Series(dic)
s

서울    800
대구    150
부산    100
dtype: int64